{"sections":{"main":{"type":"main-collection","settings":{}},"faq_bWqaWh":{"type":"faq","blocks":{"questions_mCjdNj":{"type":"questions","settings":{"title":"What tequilas are included in the LALO Tequila collection?","answer":"<p>The LALO Tequila collection features:<\/p><ul><li><strong>LALO Tequila Blanco<\/strong> – A smooth, crisp tequila bottled at <strong>40% ABV<\/strong>, perfect for sipping and mixing in cocktails.<\/li><\/ul><p><strong>LALO High Proof Tequila<\/strong> – A bolder version of the original blanco, bottled at <strong>54% ABV<\/strong>, designed for those who appreciate a more full bodied agave-forward experience.<\/p>"}},"questions_mGCX6L":{"type":"questions","settings":{"title":"How do I choose between LALO Tequila Blanco and LALO High Proof?","answer":"<p>Both tequilas share the same commitment to quality, using only <strong>three ingredients<\/strong>—fully mature Highland agave, Champagne yeast, and deep well water sourced on site—with nothing added during processing. <strong>LALO Tequila Blanco<\/strong> is known for its smooth, bright agave flavor, making it ideal for cocktails or sipping. <strong>LALO High Proof Tequila<\/strong> is crafted for those who enjoy a more concentrated, robust agave experience, with deeper complexity and a bolder finish.<\/p>"}},"questions_Y9ADmV":{"type":"questions","settings":{"title":"Where is LALO Tequila made?","answer":"<p>LALO Tequila is proudly made in <strong>Los Altos de Jalisco, Mexico<\/strong>. Each bottle is produced using traditional methods that honor Mexico’s rich tequila-making heritage, ensuring a pure expression of agave.<\/p>"}},"questions_3NG9dY":{"type":"questions","settings":{"title":"Is anything added to LALO Tequila during production?","answer":"<p>No, both <strong>LALO Tequila Blanco<\/strong> and <strong>LALO High Proof Tequila<\/strong> are made with just <strong>three ingredients<\/strong>—fully mature Blue Weber Agave, Champagne yeast, and deep well water. Nothing is added during processing, allowing the natural essence of agave to shine through.<\/p>"}},"questions_TVQjyi":{"type":"questions","settings":{"title":"Where can I buy LALO Tequila?","answer":"<p>LALO Tequila is available for purchase online and at select retailers. To find a store near you, visit our <strong>Store Locator<\/strong> for more details on availability.<\/p>"}},"questions_gFVFnD":{"type":"questions","settings":{"title":"Why Champagne Yeast?","answer":"<p>LALO Tequila uses Champagne yeast to prioritize a nuanced flavor over speed, this delivers a constantly more unique and balanced flavor profile that complements the Highland agave and deep well water.<\/p>"}},"questions_rUpMeL":{"type":"questions","settings":{"title":"Why does LALO use brick ovens?","answer":"<p>LALO Tequila uses traditional brick ovens that produce a slow, consistent cooking process. From the time the agave is loaded and the juices are extracted by roller mills is around 48-hours, ten times longer than other tequilas. <\/p>"}},"questions_QaDN7y":{"type":"questions","settings":{"title":"Is LALO tequila 100% agave?","answer":"<p>LALO tequila is made with only three ingredients; Blue Weber Agave, Champagne yeast, and deep well water. The 100% blue weber agave tequila category requires all fermentable sugars to come from the blue weber agave plant. However, added sugars or flavors may be introduced after production, before bottling. Current regulations do not require tequilas with added sugars or flavors to disclose them on the label, meaning both tequilas with and without them can be labeled as 100% blue weber agave tequila.<\/p>"}}},"block_order":["questions_mCjdNj","questions_mGCX6L","questions_Y9ADmV","questions_3NG9dY","questions_TVQjyi","questions_gFVFnD","questions_rUpMeL","questions_QaDN7y"],"settings":{"title":""}}},"order":["main","faq_bWqaWh"]}